Performance-testing/01-test-tool/taurus/scripts/yml/cover_multiple_threadgroup_exist_jmx_conifg.yml
settings:
  env:
    BASE_DIR: /home/taurus/taurus_container_scripts   # 脚本目录
  artifacts-dir: /home/taurus/taurus_container_artifacts/simple/%Y-%m-%d_%H-%M  # path where to save artifacts, default is %Y-%m-%d_%H-%M-%S.%f
 
execution:
- concurrency: 10  #并发线程数
  ramp-up: 1m      # 启动时间
  hold-for: 2m30s  # 持续时间
  scenario: simple1  # 场景名称
- concurrency: 10  #并发线程数
  ramp-up: 1m      # 启动时间
  hold-for: 2m30s  # 持续时间
  scenario: simple2  # 场景名称

scenarios:
   simple1:
        script: '${BASE_DIR}/build-web-test-plan.jmx'  # 脚本
   simple2:
        script: '${BASE_DIR}/build-ftp-test-plan.jmx'  # 脚本       

modules:
    jmeter:
        download-link: 'https://mirrors.tuna.tsinghua.edu.cn/apache//jmeter/binaries/apache-jmeter-{version}.zip' # 下载地址
        version: 5.2.1  # 版本号

reporting:
- module: final-stats   # 摘要报告
- module: console       # 控制台